In [3]:
import pandas as pd

#### Task 1.3 #5: create test dataframe with at least 1 numeric and 1 text column

In [13]:
data = pd.DataFrame({"Name":['Aragon', 'Boromir', 'Frodo', 'Galadriel'],
                    "Race": ['human', 'human', 'hobbit', 'elf'],
                     "Age": [88,41,51,8382]})

#### Task 1.3 #6: create a new column (age_2) and execute a math procedure in an existing column using a lambda function

In [15]:
divide_2 = lambda x: x/10

In [21]:
divide_2(data['Age'])

0      8.8
1      4.1
2      5.1
3    838.2
Name: Age, dtype: float64

In [19]:
data['age_2'] = divide_2(data['Age'])

In [23]:
data

        Name    Race   Age  age_2
0     Aragon   human    88    8.8
1    Boromir   human    41    4.1
2      Frodo  hobbit    51    5.1
3  Galadriel     elf  8382  838.2

#### Task 1.3 #7: Create a flag column from the text column in our example dataframe using a lambda function

In [27]:
data['age_label'] = data['Age'].apply(
    lambda x: 'elven old' if x > 500 else ('middle-aged' if x >=100 else 'young'))

In [29]:
data

        Name    Race   Age  age_2  age_label
0     Aragon   human    88    8.8      young
1    Boromir   human    41    4.1      young
2      Frodo  hobbit    51    5.1      young
3  Galadriel     elf  8382  838.2  elven old